Evaluations/perf_testing/data/composePost/202404261329_350_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read
  2 threads and 100 connections

  Thread calibration: mean lat.: 98.672ms, rate sampling interval: 228ms
  Thread calibration: mean lat.: 108.236ms, rate sampling interval: 293ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   666.53ms    1.89s    9.30s    91.80%
    Req/Sec   133.08     46.32   232.00     81.29%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  101.89ms
 75.000%  126.59ms
 90.000%  504.83ms
 99.000%    9.30s 
 99.900%   10.02s 
 99.990%   10.03s 
 99.999%   10.03s 
100.000%   10.03s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      72.127     0.000000            1         1.00
      88.447     0.100000          542         1.11
      92.415     0.200000         1082         1.25
      95.551     0.300000         1623         1.43
      98.431     0.400000         2156         1.67
     101.887     0.500000         2695         2.00
     103.615     0.550000         2969         2.22
     105.855     0.600000         3236         2.50
     109.631     0.650000         3507         2.86
     116.735     0.700000         3773         3.33
     126.591     0.750000         4043         4.00
     132.863     0.775000         4178         4.44
     141.055     0.800000         4313         5.00
     148.479     0.825000         4448         5.71
     162.303     0.850000         4582         6.67
     188.671     0.875000         4718         8.00
     212.223     0.887500         4784         8.89
     504.831     0.900000         4851        10.00
    1953.791     0.912500         4919        11.43
    3289.087     0.925000         4986        13.33
    4661.247     0.937500         5054        16.00
    5316.607     0.943750         5087        17.78
    5922.815     0.950000         5122        20.00
    6537.215     0.956250         5155        22.86
    7073.791     0.962500         5188        26.67
    7614.463     0.968750         5222        32.00
    7860.223     0.971875         5239        35.56
    8077.311     0.975000         5256        40.00
    8359.935     0.978125         5273        45.71
    8609.791     0.981250         5289        53.33
    8871.935     0.984375         5306        64.00
    8986.623     0.985938         5315        71.11
    9101.311     0.987500         5323        80.00
    9240.575     0.989062         5332        91.43
    9396.223     0.990625         5340       106.67
    9478.143     0.992188         5348       128.00
    9601.023     0.992969         5353       142.22
    9625.599     0.993750         5359       160.00
    9682.943     0.994531         5361       182.86
    9805.823     0.995313         5365       213.33
    9814.015     0.996094         5369       256.00
    9830.399     0.996484         5373       284.44
    9871.359     0.996875         5375       320.00
    9895.935     0.997266         5377       365.71
   10018.815     0.997656         5386       426.67
   10018.815     0.998047         5386       512.00
   10018.815     0.998242         5386       568.89
   10018.815     0.998437         5386       640.00
   10018.815     0.998633         5386       731.43
   10018.815     0.998828         5386       853.33
   10018.815     0.999023         5386      1024.00
   10018.815     0.999121         5386      1137.78
   10018.815     0.999219         5386      1280.00
   10027.007     0.999316         5390      1462.86
   10027.007     1.000000         5390          inf
#[Mean    =      666.535, StdDeviation   =     1888.611]
#[Max     =    10018.816, Total count    =         5390]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  8030 requests in 30.05s, 2.17MB read
  Non-2xx or 3xx responses: 15
Requests/sec:    267.20  
Transfer/sec:     73.95KB