Evaluations/perf_testing/data/composePost/202404261537_2050_2m.txt
Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read
  2 threads and 100 connections

  Thread calibration: mean lat.: 3515.965ms, rate sampling interval: 11984ms
  Thread calibration: mean lat.: 3648.205ms, rate sampling interval: 12009ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    43.66s    20.18s    1.34m    59.15%
    Req/Sec   378.72     50.31   445.00     72.22%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   45.97s 
 75.000%    1.01m 
 90.000%    1.15m 
 99.000%    1.34m 
 99.900%    1.42m 
 99.990%    1.44m 
 99.999%    1.45m 
100.000%    1.45m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6086.655     0.000000            1         1.00
   13778.943     0.100000         8330         1.11
   21184.511     0.200000        16670         1.25
   31490.047     0.300000        24987         1.43
   40370.175     0.400000        33311         1.67
   45973.503     0.500000        41677         2.00
   48627.711     0.550000        45835         2.22
   51478.527     0.600000        49961         2.50
   54591.487     0.650000        54135         2.86
   57475.071     0.700000        58314         3.33
   60358.655     0.750000        62467         4.00
   61767.679     0.775000        64559         4.44
   63209.471     0.800000        66628         5.00
   64487.423     0.825000        68717         5.71
   65896.447     0.850000        70777         6.67
   67436.543     0.875000        72894         8.00
   68157.439     0.887500        73945         8.89
   68943.871     0.900000        74976        10.00
   69926.911     0.912500        76043        11.43
   70844.415     0.925000        77049        13.33
   71827.455     0.937500        78073        16.00
   72351.743     0.943750        78631        17.78
   72876.031     0.950000        79111        20.00
   73531.391     0.956250        79626        22.86
   74383.359     0.962500        80149        26.67
   75366.399     0.968750        80669        32.00
   75956.223     0.971875        80952        35.56
   76480.511     0.975000        81207        40.00
   77004.799     0.978125        81453        45.71
   77660.159     0.981250        81714        53.33
   78643.199     0.984375        81970        64.00
   79101.951     0.985938        82098        71.11
   79626.239     0.987500        82235        80.00
   80084.991     0.989062        82360        91.43
   80543.743     0.990625        82487       106.67
   81002.495     0.992188        82616       128.00
   81264.639     0.992969        82686       142.22
   81592.319     0.993750        82759       160.00
   81919.999     0.994531        82819       182.86
   82247.679     0.995313        82877       213.33
   82640.895     0.996094        82943       256.00
   82968.575     0.996484        82978       284.44
   83230.719     0.996875        83007       320.00
   83558.399     0.997266        83039       365.71
   83951.615     0.997656        83075       426.67
   84279.295     0.998047        83105       512.00
   84475.903     0.998242        83121       568.89
   84738.047     0.998437        83137       640.00
   84934.655     0.998633        83154       731.43
   85131.263     0.998828        83171       853.33
   85327.871     0.999023        83188      1024.00
   85393.407     0.999121        83195      1137.78
   85458.943     0.999219        83203      1280.00
   85524.479     0.999316        83212      1462.86
   85590.015     0.999414        83218      1706.67
   85786.623     0.999512        83229      2048.00
   85852.159     0.999561        83232      2275.56
   85917.695     0.999609        83237      2560.00
   85983.231     0.999658        83241      2925.71
   86048.767     0.999707        83245      3413.33
   86114.303     0.999756        83246      4096.00
   86245.375     0.999780        83248      4551.11
   86376.447     0.999805        83252      5120.00
   86376.447     0.999829        83252      5851.43
   86441.983     0.999854        83254      6826.67
   86507.519     0.999878        83257      8192.00
   86507.519     0.999890        83257      9102.22
   86573.055     0.999902        83259     10240.00
   86573.055     0.999915        83259     11702.86
   86704.127     0.999927        83261     13653.33
   86704.127     0.999939        83261     16384.00
   86769.663     0.999945        83262     18204.44
   86769.663     0.999951        83262     20480.00
   86835.199     0.999957        83263     23405.71
   86835.199     0.999963        83263     27306.67
   86900.735     0.999969        83264     32768.00
   86900.735     0.999973        83264     36408.89
   86900.735     0.999976        83264     40960.00
   87031.807     0.999979        83266     46811.43
   87031.807     1.000000        83266          inf
#[Mean    =    43664.955, StdDeviation   =    20182.022]
#[Max     =    86966.272, Total count    =        83266]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  89725 requests in 2.00m, 24.28MB read
  Non-2xx or 3xx responses: 244
Requests/sec:    747.70  
Transfer/sec:    207.15KB